Revit 2024 API
DimensionType.GetOrdinateDimensionSetting Method
 Gets the ordinate dimension settings for this DimensionType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public OrdinateDimensionSetting GetOrdinateDimensionSetting()
Visual Basic
Public Function GetOrdinateDimensionSetting As OrdinateDimensionSetting
Visual C++
public:
OrdinateDimensionSetting^ GetOrdinateDimensionSetting()
Return Value
 The ordinate dimension settings.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace